In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv ('titanic.csv', index_col='PassengerId')

In [3]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [91]:
total = data.shape[0]
total

891

In [5]:
data.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [7]:
#Доля выжиывших
100*data.Survived.value_counts()[1]/total

38.38383838383838

In [92]:
# Доля пассажиров в 1м классе
data.Pclass.value_counts()
100*216/891

24.242424242424242

In [9]:
data.aggregate({'Age':["mean", "median"]})

              Age
mean    29.699118
median  28.000000

In [18]:
data.corr(method = 'pearson')

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
Age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [ ]:
female_names = data.query("Sex == 'female'").Name.str.split()

In [115]:
female_names = data.query("Sex == 'female'").Name

In [116]:
female_names.head()

PassengerId
2     Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                Heikkinen, Miss. Laina
4          Futrelle, Mrs. Jacques Heath (Lily May Peel)
9     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                  Nasser, Mrs. Nicholas (Adele Achem)
Name: Name, dtype: object

In [131]:
female_names.apply(lambda x: x.split(',')[1].split('.')[1].split('(')[0]).value_counts()

                             16
 Mary                         6
 William                      5
 Bertha                       4
 Thomas                       3
 Anna                         3
 Anna Sofia                   3
 Joseph                       3
 James                        2
 Kate                         2
 Samuel                       2
 Katherine "Katie"            2
 Marija                       2
 Hanora "Nora"                2
 Alice                        2
 Edward                       2
 Elizabeth                    2
 Ellen "Nellie"               2
 Lucile Polk                  1
 Victor de Satode             1
 Matilda                      1
 Frederick Maxfield           1
 Frank Manley                 1
 Dorothy Edith "Dolly"        1
 Florence "Fannie"            1
 Jacques Heath                1
 Percival                     1
 Amelie                       1
 Velin                        1
 Charles Alexander            1
                             ..
 John                         1
 Darwis                       1
 Alexander Oskar              1
 Phyllis May                  1
 Margaret Delia               1
 Augusta Maria                1
 William A                    1
 Catherine Helen "Carrie"     1
 Susan                        1
 Carla Christine Nielsine     1
 Nils                         1
 Elizabeth                    1
 Frederick Joel               1
 Telma Matilda                1
 Daisy E                      1
 Annie Jessie "Nina"          1
 Gerda Ulrika                 1
 Marguerite Rut               1
 Mary Conover                 1
 Caroline Louise              1
 Gretchen Fiske               1
 Marjorie                     1
 Ingeborg Constanzia          1
 James Joseph                 1
 Charles Melville             1
 John T                       1
 Martin                       1
 Leontine Pauline             1
 Antoni                       1
 Lyyli Karoliina              1
Name: Name, Length: 269, dtype: int64